BDD-Cucumber/app/controllers/movies_controller.rb

  def show
    id = params[:id] # retrieve movie ID from URI route
    begin
      @movie = Movie.find(id)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 9999]]